{
  "nodes": [
    {
      "op": "null", 
      "name": "0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "0_NCHW3c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___13", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "1_OIHW3i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "20_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "28_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "30_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "39_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "47_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [13, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "56_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "64_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "66_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "75_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_4", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "83_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [32, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8_NCHW2c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___14", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "92_OIHW2i3o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_5", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "100_OIHW3i3o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8_NCHW2c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___14", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "102_OIHW2i3o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "111_OIHW3i3o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_6", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "119_OIHW3i3o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add5_NCHW1c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___15", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "2_OIHW1i2o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "0_NCHW3c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___13", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "3_OIHW3i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "130_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "138_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "140_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc20", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[70, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "149_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "157_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [78, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "166_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "174_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "176_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc25", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[89, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu18", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "185_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu19", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_4", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "193_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm20_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm20_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu20", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [97, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu20_NCHW2c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___14", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "202_OIHW2i3o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm21_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm21_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu21", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_5", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "210_OIHW3i3o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu20_NCHW2c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___14", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "212_OIHW2i3o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc30", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm22_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm22_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu22", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "221_OIHW3i3o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm23_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm23_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu23", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_6", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "229_OIHW3i3o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add11_NCHW1c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___15", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "4_OIHW1i2o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc33", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm24_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm24_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu24_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_concatenate_broadcast_mul_broadcast_add_relu___layout_transform__", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[65, 0, 0], [130, 0, 0], [131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "12_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc34", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_5", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "__mul_scalar__0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___flatten_flatten___mul_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "__mul_scalar__1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    10, 
    11, 
    14, 
    15, 
    17, 
    18, 
    19, 
    21, 
    22, 
    23, 
    25, 
    26, 
    27, 
    29, 
    30, 
    33, 
    34, 
    36, 
    37, 
    38, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    49, 
    51, 
    54, 
    55, 
    57, 
    58, 
    59, 
    61, 
    64, 
    67, 
    68, 
    69, 
    71, 
    72, 
    73, 
    75, 
    76, 
    79, 
    80, 
    82, 
    83, 
    84, 
    86, 
    87, 
    88, 
    90, 
    91, 
    92, 
    94, 
    95, 
    98, 
    99, 
    101, 
    102, 
    103, 
    105, 
    106, 
    107, 
    110, 
    111, 
    112, 
    114, 
    116, 
    119, 
    120, 
    122, 
    123, 
    124, 
    126, 
    129, 
    131, 
    132, 
    134, 
    137, 
    138
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140
  ], 
  "heads": [[139, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        6, 
        0, 
        7, 
        8, 
        9, 
        1, 
        10, 
        11, 
        12, 
        0, 
        13, 
        14, 
        2, 
        1, 
        15, 
        16, 
        0, 
        17, 
        18, 
        19, 
        2, 
        20, 
        21, 
        22, 
        0, 
        23, 
        24, 
        25, 
        2, 
        26, 
        27, 
        1, 
        0, 
        28, 
        29, 
        2, 
        30, 
        31, 
        32, 
        1, 
        33, 
        34, 
        35, 
        2, 
        1, 
        36, 
        37, 
        38, 
        0, 
        39, 
        1, 
        40, 
        2, 
        1, 
        41, 
        42, 
        0, 
        43, 
        44, 
        45, 
        2, 
        46, 
        0, 
        2, 
        47, 
        1, 
        0, 
        48, 
        49, 
        50, 
        2, 
        51, 
        52, 
        53, 
        0, 
        54, 
        55, 
        3, 
        2, 
        56, 
        57, 
        0, 
        58, 
        59, 
        60, 
        3, 
        61, 
        62, 
        63, 
        0, 
        64, 
        65, 
        66, 
        3, 
        67, 
        68, 
        2, 
        0, 
        69, 
        70, 
        3, 
        71, 
        72, 
        73, 
        2, 
        74, 
        75, 
        76, 
        3, 
        2, 
        77, 
        78, 
        79, 
        0, 
        80, 
        2, 
        81, 
        3, 
        2, 
        82, 
        83, 
        0, 
        84, 
        85, 
        86, 
        3, 
        87, 
        0, 
        3, 
        88, 
        2, 
        89, 
        90, 
        0, 
        91, 
        4, 
        5, 
        92, 
        93, 
        4]], 
    "shape": ["list_shape", [
        [1, 3, 32, 32], 
        [1, 1, 32, 32, 3], 
        [2, 1, 3, 3, 3, 8], 
        [2, 1, 1, 8], 
        [2, 1, 1, 8], 
        [1, 2, 32, 32, 8], 
        [4, 2, 3, 3, 8, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [4, 4, 3, 3, 8, 8], 
        [4, 2, 1, 1, 8, 8], 
        [1, 4, 32, 32, 8], 
        [1, 4, 32, 32, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [4, 4, 3, 3, 8, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [4, 4, 3, 3, 8, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [8, 4, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 4, 1, 1, 8, 8], 
        [1, 8, 16, 16, 8], 
        [1, 8, 16, 16, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [1, 32, 16, 16, 2], 
        [29, 32, 3, 3, 2, 3], 
        [29, 1, 1, 3], 
        [29, 1, 1, 3], 
        [1, 29, 8, 8, 3], 
        [29, 29, 3, 3, 3, 3], 
        [1, 32, 16, 16, 2], 
        [29, 32, 1, 1, 2, 3], 
        [1, 29, 8, 8, 3], 
        [1, 29, 8, 8, 3], 
        [29, 1, 1, 3], 
        [29, 1, 1, 3], 
        [1, 29, 8, 8, 3], 
        [29, 29, 3, 3, 3, 3], 
        [29, 1, 1, 3], 
        [29, 1, 1, 3], 
        [1, 29, 8, 8, 3], 
        [29, 29, 3, 3, 3, 3], 
        [1, 29, 8, 8, 3], 
        [1, 87, 8, 8, 1], 
        [17, 87, 1, 1, 1, 2], 
        [1, 17, 8, 8, 2], 
        [1, 1, 32, 32, 3], 
        [2, 1, 3, 3, 3, 8], 
        [2, 1, 1, 8], 
        [2, 1, 1, 8], 
        [1, 2, 32, 32, 8], 
        [4, 2, 3, 3, 8, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [4, 4, 3, 3, 8, 8], 
        [4, 2, 1, 1, 8, 8], 
        [1, 4, 32, 32, 8], 
        [1, 4, 32, 32, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [4, 4, 3, 3, 8, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [4, 4, 3, 3, 8, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [8, 4, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 4, 1, 1, 8, 8], 
        [1, 8, 16, 16, 8], 
        [1, 8, 16, 16, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [1, 32, 16, 16, 2], 
        [29, 32, 3, 3, 2, 3], 
        [29, 1, 1, 3], 
        [29, 1, 1, 3], 
        [1, 29, 8, 8, 3], 
        [29, 29, 3, 3, 3, 3], 
        [1, 32, 16, 16, 2], 
        [29, 32, 1, 1, 2, 3], 
        [1, 29, 8, 8, 3], 
        [1, 29, 8, 8, 3], 
        [29, 1, 1, 3], 
        [29, 1, 1, 3], 
        [1, 29, 8, 8, 3], 
        [29, 29, 3, 3, 3, 3], 
        [29, 1, 1, 3], 
        [29, 1, 1, 3], 
        [1, 29, 8, 8, 3], 
        [29, 29, 3, 3, 3, 3], 
        [1, 29, 8, 8, 3], 
        [1, 87, 8, 8, 1], 
        [23, 87, 1, 1, 1, 2], 
        [1, 23, 8, 8, 2], 
        [40, 1, 1, 2], 
        [40, 1, 1, 2], 
        [1, 10, 8, 8, 8], 
        [10, 10, 8, 8, 8, 8], 
        [1, 10, 1, 1, 8], 
        [1, 80], 
        [10, 80], 
        [10], 
        [1, 10]]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]]
  }
}