{
  "nodes": [
    {
      "op": "null", 
      "name": "0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[3, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[2, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[11, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[12, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[20, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "10", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[29, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[30, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm1_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[28, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "14", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[38, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "18", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[42, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[41, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[50, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[51, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm2_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[49, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "24", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[60, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[59, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[68, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[69, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "22", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm3_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[67, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "26", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add1", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[77, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "30", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[79, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[78, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[87, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[88, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "28", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm4_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "32", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "36", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[97, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[96, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[105, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[106, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "34", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm5_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[104, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "38", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add2", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[114, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "42", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[116, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[115, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[124, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[125, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "40", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm6_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[123, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "44", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "48", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[134, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "45", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[133, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[142, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[143, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "46", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[141, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "50", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add3", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[151, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "54", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[153, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "51", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[152, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "53", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[161, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[162, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "52", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm8_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[160, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "56", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "60", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[171, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "57", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[170, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "59", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[179, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[180, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "58", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm9_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[178, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "62", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add4", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[188, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "66", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[190, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "63", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[193, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[189, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "65", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[198, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[199, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "64", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm10_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[197, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "68", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[205, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "72", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[208, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "69", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[207, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "71", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[216, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[217, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "70", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm11_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[215, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "74", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[223, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add5", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[225, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "78", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[227, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "75", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[230, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_1", 
        "num_inputs": "2", 
