{
  "nodes": [
    {
      "op": "null", 
      "name": "0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "6", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_add_eps", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___add_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_sqrt", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_sqrt", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___rdiv_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_gamma_mul_div", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_a_mul_data", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_neg_mean", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_negative", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[9, 0, 1]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_neg_mean_mul_a", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_mul", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[10, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_add_beta", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_elemwise_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_add_beta_expand", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_expand_dims", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm0_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[8, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse_relu", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "conv2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten_1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "__mul_scalar__0", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___mul_scalar__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "2", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "__mul_scalar__1", 
      "attrs": {
        "flatten_data": "1", 
        "func_name": "fuse___mul_scalar___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "dense0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [24, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 5, 9, 12, 17, 22, 23], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26
  ], 
  "heads": [[25, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        5, 
        6, 
        0, 
        1, 
        0, 
        7, 
        1, 
        0, 
        2, 
        8, 
        0, 
        3, 
        9, 
        0, 
        1, 
        4, 
        2, 
        10, 
        3, 
        0, 
        1, 
        3, 
        11, 
        12, 
        0, 
        1]], 
    "shape": ["list_shape", [
        [1, 80, 8, 8], 
        [80], 
        [80], 
        [80], 
        [80], 
        [80], 
        [80], 
        [80, 1, 1], 
        [1, 80, 8, 8], 
        [80], 
        [80], 
        [80], 
        [80], 
        [80], 
        [80, 1, 1], 
        [1, 80, 8, 8], 
        [1, 80, 8, 8], 
        [80, 80, 8, 8], 
        [1, 80, 1, 1], 
        [1, 80], 
        [1, 80], 
        [1, 80], 
        [10, 80], 
        [10], 
        [10], 
        [1, 10]]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]]
  }
}