{
  "nodes": [
    {
      "op": "null", 
      "name": "0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "0_NCHW3c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___11", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "1_OIHW3i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "10_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "18_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "20_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "29_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "37_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [13, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "46_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "54_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "56_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[24, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "65_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_4", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "73_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [32, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8_NCHW2c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "82_OIHW2i3o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_5", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "90_OIHW3i3o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8_NCHW2c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___12", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "92_OIHW2i3o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "101_OIHW3i3o", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_broadcast_mul_broadcast_add_relu_6", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "109_OIHW3i3o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_elemwise_add_2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "elemwise_add5_NCHW1c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___13", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "2_OIHW1i2o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    6, 
    7, 
    8, 
    10, 
    11, 
    14, 
    15, 
    17, 
    18, 
    19, 
    21, 
    22, 
    23, 
    25, 
    26, 
    27, 
    29, 
    30, 
    33, 
    34, 
    36, 
    37, 
    38, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    49, 
    51, 
    54, 
    55, 
    57, 
    58, 
    59, 
    61, 
    64
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66
  ], 
  "heads": [[65, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        3, 
        0, 
        4, 
        5, 
        6, 
        1, 
        7, 
        8, 
        9, 
        0, 
        10, 
        11, 
        2, 
        1, 
        12, 
        13, 
        0, 
        14, 
        15, 
        16, 
        2, 
        17, 
        18, 
        19, 
        0, 
        20, 
        21, 
        22, 
        2, 
        23, 
        24, 
        1, 
        0, 
        25, 
        26, 
        2, 
        27, 
        28, 
        29, 
        1, 
        30, 
        31, 
        32, 
        2, 
        1, 
        33, 
        34, 
        35, 
        0, 
        36, 
        1, 
        37, 
        2, 
        1, 
        38, 
        39, 
        0, 
        40, 
        41, 
        42, 
        2, 
        43, 
        0, 
        2, 
        44, 
        1]], 
    "shape": ["list_shape", [
        [1, 3, 32, 32], 
        [1, 1, 32, 32, 3], 
        [2, 1, 3, 3, 3, 8], 
        [2, 1, 1, 8], 
        [2, 1, 1, 8], 
        [1, 2, 32, 32, 8], 
        [4, 2, 3, 3, 8, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [4, 4, 3, 3, 8, 8], 
        [4, 2, 1, 1, 8, 8], 
        [1, 4, 32, 32, 8], 
        [1, 4, 32, 32, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [4, 4, 3, 3, 8, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [4, 4, 3, 3, 8, 8], 
        [4, 1, 1, 8], 
        [4, 1, 1, 8], 
        [1, 4, 32, 32, 8], 
        [8, 4, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 4, 1, 1, 8, 8], 
        [1, 8, 16, 16, 8], 
        [1, 8, 16, 16, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [8, 8, 3, 3, 8, 8], 
        [8, 1, 1, 8], 
        [8, 1, 1, 8], 
        [1, 8, 16, 16, 8], 
        [1, 32, 16, 16, 2], 
        [29, 32, 3, 3, 2, 3], 
        [29, 1, 1, 3], 
        [29, 1, 1, 3], 
        [1, 29, 8, 8, 3], 
        [29, 29, 3, 3, 3, 3], 
        [1, 32, 16, 16, 2], 
        [29, 32, 1, 1, 2, 3], 
        [1, 29, 8, 8, 3], 
        [1, 29, 8, 8, 3], 
        [29, 1, 1, 3], 
        [29, 1, 1, 3], 
        [1, 29, 8, 8, 3], 
        [29, 29, 3, 3, 3, 3], 
        [29, 1, 1, 3], 
        [29, 1, 1, 3], 
        [1, 29, 8, 8, 3], 
        [29, 29, 3, 3, 3, 3], 
        [1, 29, 8, 8, 3], 
        [1, 87, 8, 8, 1], 
        [23, 87, 1, 1, 1, 2], 
        [1, 23, 8, 8, 2]]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]]
  }
}